'''
帳號密碼登入
【題目情境】請寫一個模擬系統登入驗證的程式(使用while迴圈)。
系統內建的正確帳號為 [自行設定]，正確密碼為 [自行設定] ， 輸入帳號與密碼各有三次的機會，密碼正確即跳出迴圈。
【功能需求與邏輯】
輸入帳號：程式啟動時，先提示使用者輸入帳號。
檢查帳號：
若帳號正確：才提示使用者輸入密碼，並進行密碼檢查。
若密碼正確：印出 "密碼正確"。
若密碼錯誤：印出 "密碼錯誤"。
若帳號錯誤：直接印出 "帳號錯誤"，且不提示輸入密碼。

'''

def login():
  count1=0
  while count1<3:
    account = input("請輸入帳號：")
    if account != "admin":
      print("帳號錯誤,請重新輸入")
      count1+=1
      continue
    else:
      count2=0
      while count2<3:
        password = input("請輸入密碼：")
        if password != "abcd1234":
          print("密碼錯誤,請重新輸入")
          count2+=1
          continue
        else:
          print("帳號、密碼正確，歡迎進入本系統")
          break
      break

'''
倒數字直角三角形
【問題描述】
請撰寫一個 Python 程式，讓使用者輸入一個正整數作為三角形的高度（總層數）。
程式必須利用雙重 for 迴圈（巢狀迴圈），在螢幕上印出一個向左靠齊的「倒數字直角三角形」。
【功能與排版需求】
數學規律（以高度 5 為例）：
	• 第 1 層：從 1 印到 5
	• 第 2 層：從 1 印到 4
	• 第 3 層：從 1 印到 3
	• 依此類推，每一層都要從 1 開始印，但結束的數字會隨著層數增加而逐漸遞減。
        • 當某一層的數字全部印完後，程式必須正確換行，再開始印下一層。
【輸入與輸出範例】

'''

def count_triangle():
  number=int(input("請輸入三角形高度"))

  for i in range(1,number+1):
    for j in range(1,(number-i)+2):
      print(j,end="")
    print()


'''
數字直角三角形
【問題描述】
請撰寫一個 Python 程式，讓使用者輸入一個正整數作為三角形的高度（總層數）。
程式必須利用雙重 for 迴圈（巢狀迴圈），在螢幕上印出一個向左靠齊的「數字直角三角形」。
【功能與排版需求】
• 第 1 層：印出 1
• 第 2 層：印出 12
• 第 3 層：印出 123
• 依此類推，第 i層樓必須從 1 開始，連續水平印到數字 i。
•當某一層的數字全部印完後，程式必須正確換行，再開始印下一層。

【輸入與輸出範例】

'''
def tria():
  number = int(input("請輸入三角形高度"))
  for i in range(1,number+1):
    for j in range(1,i+1):
      print(j,end="")
    print()


if __name__ == "__main__":
  tria()
