'''
帳號密碼登入
【題目情境】請寫一個模擬系統登入驗證的程式(使用while迴圈)。
系統內建的正確帳號為 [自行設定]，正確密碼為 [自行設定] ， 輸入帳號與密碼各有三次的機會，密碼正確即跳出迴圈。
【功能需求與邏輯】
輸入帳號：程式啟動時，先提示使用者輸入帳號。
檢查帳號：
若帳號正確：才提示使用者輸入密碼，並進行密碼檢查。
若密碼正確：印出 "密碼正確"。
若密碼錯誤：印出 "密碼錯誤"。
若帳號錯誤：直接印出 "帳號錯誤"，且不提示輸入密碼。

'''

def login():
  count1=0
  while count1<3:
    account = input("請輸入帳號：")
    if account != "admin":
      print("帳號錯誤,請重新輸入")
      count1+=1
      continue
    else:
      count2=0
      while count2<3:
        password = input("請輸入密碼：")
        if password != "abcd1234":
          print("密碼錯誤,請重新輸入")
          count2+=1
          continue
        else:
          print("帳號、密碼正確，歡迎進入本系統")
          break
      break

'''
倒數字直角三角形
【問題描述】
請撰寫一個 Python 程式，讓使用者輸入一個正整數作為三角形的高度（總層數）。
程式必須利用雙重 for 迴圈（巢狀迴圈），在螢幕上印出一個向左靠齊的「倒數字直角三角形」。
【功能與排版需求】
數學規律（以高度 5 為例）：
	• 第 1 層：從 1 印到 5
	• 第 2 層：從 1 印到 4
	• 第 3 層：從 1 印到 3
	• 依此類推，每一層都要從 1 開始印，但結束的數字會隨著層數增加而逐漸遞減。
        • 當某一層的數字全部印完後，程式必須正確換行，再開始印下一層。
【輸入與輸出範例】

'''

def count_triangle():
  number=int(input("請輸入三角形高度"))

  for i in range(1,number+1):
    for j in range(1,(number-i)+2):
      print(j,end="")
    print()


'''
數字直角三角形
【問題描述】
請撰寫一個 Python 程式，讓使用者輸入一個正整數作為三角形的高度（總層數）。
程式必須利用雙重 for 迴圈（巢狀迴圈），在螢幕上印出一個向左靠齊的「數字直角三角形」。
【功能與排版需求】
• 第 1 層：印出 1
• 第 2 層：印出 12
• 第 3 層：印出 123
• 依此類推，第 i層樓必須從 1 開始，連續水平印到數字 i。
•當某一層的數字全部印完後，程式必須正確換行，再開始印下一層。

【輸入與輸出範例】

'''
def tria():
  number = int(input("請輸入三角形高度"))
  for i in range(1,number+1):
    for j in range(1,i+1):
      print(j,end="")
    print()


'''
購物車「不可折抵商品」結帳系統
Anita在雙 11 購物節挑選了 6 樣商品，商品的原始價格依序存放在 prices 串列中。
電商舉辦了滿額現折活動，但活動規則有一項限制：「特價促銷商品（大於等於 1000 元的商品）不列入折扣累積金額」。
請撰寫一個 Python 程式，利用 for 迴圈 逐一讀取商品價格：
prices = [150, 1200, 350, 990, 2500, 400]
1.遇到大於等於 1000 元的商品時，請跳過該商品，不將它計入本次折扣總金額中。
2.其餘小於 1000 元的商品則正常累加。
3.迴圈結束後，請在螢幕上印出可以參與折扣的商品總金額。
'''
def shopping_cart():
  total_money=0
  prices = [150, 1200, 350, 990, 2500, 400]
  for x in prices:
    if x <1000:
      total_money+=x

  print(f"可參與折扣商品的總金額為：{total_money}")


'''
抽卡冒險系統（體力值扣除機制）
【問題描述】
在一個冒險遊戲中，勇者想要進行「幸運抽卡」。每次成功抽卡都需要消耗 1 點體力值。
勇者目前總共有 3 點體力值。
然而，抽卡轉盤非常不穩定，有時會抽到 無效（空的） 的壞結果。
工程師為了公平起見，規定：「如果抽到無效結果，本次不進行任何計分，且不能扣除勇者的體力值，
必須讓勇者繼續抽，直到體力值老老實實扣完為止。」
請撰寫一個 Python 程式，利用 while 迴圈 模擬這個過程：
1. 迴圈必須以「體力值大於 0」作為持續執行的條件。
2. 每次抽卡時，由使用者輸入抽到的結果（字串型態，可輸入：中獎、沒中、無效）。
3. 若輸入 "無效"：程式必須印出 "號誌異常，本次抽卡無效（不扣體力）！"，
並利用 continue 關鍵字直接跳過，絕對不能扣除體力值。
4. 若輸入 "中獎" 或 "沒中"：代表這是一次成功的嘗試，程式必須將體力值 -1。
5. 當體力值歸零（降到 0）時，迴圈自動結束，並印出 "體力值已耗盡，抽卡結束！"。
'''
def throw_card():
  blood=3
  while blood>0:
    throw_card_str=input("請輸入抽獎結果：")
    if not(throw_card_str=="中獎" or throw_card_str =="沒中"):
      print("號誌異常，本次抽卡無效（不扣體力）！")
      continue
    print(f"勇者抽到{throw_card_str}，體力值扣1")
    blood -= 1
  print("勇者體力為0，抽獎結束")

if __name__ == "__main__":
  throw_card()
