'''
(一)阿姆斯壯數（Armstrong Number）
題目說明:
阿姆斯壯數（又稱水仙花數）是指一個三位數，其百位數、十位數及個位數的三次方總和，恰好等於該數字本身。
例如：153 為阿姆斯壯數，因為：
153 = 1³ + 5³ + 3³ = 1 + 125 + 27
請撰寫一個 Python 程式，找出 100 至 999 之間所有符合條件的阿姆斯壯數，並依照由小到大的順序輸出。
程式撰寫限制:
1.必須使用 for 迴圈，逐一檢查 100 至 999 之間的整數。

2.必須使用 if 判斷式，判斷該數字是否符合阿姆斯壯數的條件。

3.不得直接將已知的阿姆斯壯數寫入程式中輸出。

4.不得使用字串轉換、串列（List）或其他方式取代數字拆解運算。
'''
ll=[]

for i in range(100,1000):
  hundary=i//100
  ten1=i//10-hundary*10
  k=i-(hundary*100)-(ten1*10)
  vv=(hundary**3)+(ten1**3)+(k**3)
  if i ==vv :
    ll.append(i)

print(ll)
