
'''
一、題目說明
現有四個數字：1、2、3、4。
請撰寫 Python 程式，利用這四個數字組成所有可能的三位數，且每個三位數中的百位、十位與個位數字皆不可重複。
請依照數字由小到大的順序，輸出所有符合條件的三位數，並在最後輸出符合條件的總數。
二、輸入說明
本題不需要輸入任何資料。
三、輸出說明
每行輸出一個符合條件的三位數。
所有三位數必須由小到大排列。
最後一行輸出符合條件的總數。
四、輸出範例
123
124
132
134
142
143
213
214
231
234
241
243
312
314
321
324
341
342
412
413
421
423
431
432
四、程式限制
必須使用巢狀 for 迴圈，分別代表百位、十位與個位數字。
必須使用 if 判斷三個位數是否互不相同。
不得直接列出或寫死所有符合條件的三位數。
不得使用 itertools 或其他排列組合函式庫。
不得使用 List 預先儲存所有答案。
必須使用程式計算符合條件的總數。
'''
def a():
  value=[]
  ll=[1,2,3,4,5]
  for hu in ll:
    for ten1 in ll:
      for on1 in ll:
        if hu!=ten1 and hu!=on1 and ten1 != on1:
          value.append(str(hu)+str(ten1)+str(on1))

  for vvs in value:
    print(vvs)

  print(f'length :{ len(value)}')

'''
(一)完美數判斷
一、題目說明
完美數（Perfect Number）是指一個正整數，其所有「正因數（不包含數字本身）」的總和，恰好等於該數字本身。
例如：
6 的正因數（不包含 6）為 1、2、3，因為 1 + 2 + 3 = 6，因此 6 是完美數。
28 的正因數（不包含 28）為 1、2、4、7、14，因為 1 + 2 + 4 + 7 + 14 = 28，因此 28 是完美數。
12 的正因數（不包含 12）為 1、2、3、4、6，因為 1 + 2 + 3 + 4 + 6 = 16，不等於 12，因此 12 不是完美數。
請撰寫一個 Python 程式，輸入一個正整數 N，判斷 N 是否為完美數。
二、輸入說明
輸入一個正整數 N，其中 1 ≤ N ≤ 10000。
三、輸出說明
若 N 為完美數，輸出 YES。
若 N 不是完美數，輸出 NO。
輸出結果須完全符合指定格式，不得包含其他文字。
四、範例測試
範例一
輸入：
6
輸出：
YES
範例二
輸入：
12
輸出：
NO
範例三
輸入：
28
輸出：
YES
五、程式限制
必須使用 for 迴圈尋找 N 的正因數。
必須使用 % 運算子判斷是否能整除。
必須使用變數累加符合條件的因數。
必須使用 if 判斷因數總和是否等於 N。
不得直接寫死特定完美數的判斷結果。
不得使用 List 或其他容器預先儲存因數。
'''
def b():
  nu=int(input("請輸入一個整數，幫你判斷是不是完美數"))
  ans=[]
  for i in range(1,nu):
    if (nu%i)==0:
      ans.append(i)

  sum_1=0
  print(f'ans:{ans}')
  for vv in ans:
    sum_1+=vv

  if sum_1==nu:
    print(f'{nu}是完美數,Yes')
  else:
    print(f'{nu}不是完美數,NO')

a()